import React from "react";

import styles from "./CarCrashDocumentation.module.css";

const CarCrashDocumentation = () => (
  <>
    <h1>Документация</h1>
    <div className={styles.Documentation}>
      <h3>СЪДЪРЖАНИЕ</h3>
      <ol>
        <li>
          <p>Какво е виртуален сензор?</p>
          <ul>
            <li>Същност</li>
            <li>Предимства на виртуалните сензори пред физическите</li>
            <li>Приложение</li>
          </ul>
        </li>

        <li>
          <p>Виртуален сензор за изчисляване вероятността за смъртност
при катастрофа, ако има такава.
          </p>
          <ul>
            <li>Специфики при изчисляване вероятността за смъртност
при катастрофа
            </li>
            <li>Методи за измерване</li>
          </ul>
        </li>

        <li><p>Описание на работата на виртуалния сензор</p></li>
        <li><p>Резултати от проведени тестове</p></li>
        <li><p>Източници</p></li>
      </ol>

      <h3>Какво е виртуален сензор?</h3>
      <h5>Същност</h5>
      <p>Виртуалните сензори отчитат качеставата на продукти или
параметрите на процеси посредством математически модели
като заместител на физичните сензори или в комбинация с
тях. Те се прилагат като надеждна и по-евтина алтернатива на
скъпите и непрактични физически измервания.
      </p>

      <h5>Предимства на виртуалните сензори пред физическите</h5>
      <p>Има няколко причини виртуалните сензори да са
предпочитани пред физическите:
      </p>
      <ul>
        <li>
          <p>Трудно отчитане чрез физическите сензори</p>
        </li>
        <li>
          <p>Физическите сензори са твърде бавни</p>
        </li>
        <li>
          <p>Инсталирането на физически сензор е твърде скъпо</p>
        </li>
        <li>
          <p>Пространството не позволява инсталирането на физичен
сензор
          </p>
        </li>
      </ul>
      <p>
      Това са достатъчно причини, за да се избира повече
виртуалния сензор пред физичния.
      </p>

      <h5>Приложение</h5>
      <p>Виртуалните датчици извършват индиректни отчитания на
абстрактни условия (които не са физически измерими) чрез
компилиране и анализирани на данни. Приложението на
такива сензори вече е утвърдено в редица области. Сред тях
са автомобилостроенето, роботиката, жилищната и сградна
автоматизация. Предстои масово налагане и в
машиностроенето. Най-разпространените приложения на
такива решения са за отчитане на вибрации, прогнозиране на
смущения и предсказване на грешката.
      </p>

      <h3>Виртуален сензор за изчисляване вероятността за смъртност
при катастрофа
      </h3>
      <h5>Специфики при изчисляване вероятността за смъртност при
катастрофа
      </h5>
      <p>Всички знаят, че автомобилните катастрофи са много
опасни, но как може да бъде обясненя чрез физиката? Можем
ли да предвидим последствията от автомобилна катастрофа?
Това са въпроси, които вълнуват хората. За да намерим
отговори на въпросите е нужно да проведем опит за
симулация на катастрофа. Нещата, които ще са ни необходими
са:
      </p>
      <ul>
        <li><p>Автомобил</p></li>
        <li><p>Шофьор</p></li>
        <li><p>Подходящо място за симулация</p></li>
        <li><p>Препятствие за сблъсък</p></li>
        <li><p>Информация за условията на околната среда</p></li>
      </ul>
      <p>
      Неща, които можем лесно да осигурим. Но какво става, ако
искаме да проведем същия опит, но при други условия на
пътя, с друг шофьор. Катастрофата зависи от твърде много
условия и дори малка промяна на едно от тях би довело до
различен резултат. Провеждането на няколко опита би било

възможно, но ако искаме да имаме по-добри резултати и по-
точни са необходими безброй много опити. За целта

създадохме виртуален сензор, който позволява потребителят
да придобие представа как различните фактори определят
вероятността за смъртност.
      </p>

      <h5>Методи за измерване</h5>
      <p>Автомобилът започва да се движи с определена скорост. На
дадено разстояние от него има препяствие, което ще доведе
до катастрофа, ако шофьорът не успее да спре на време.
Шофьорът забелязва пречката пред себе си и започва да
натиска спирачките. Измерваме спирачния път, ако имаме
сблъсък продължаваме с измерванията. При сблъсък колата
няма да е достигнала скорост 0 km/h , за целта трябва да
определим с какава скорост ще се блъсне колата. Тази скорост
ни е необходима, за да намерим с каква сила ще бъде ударът,
който ще понесе шофьорът. След изчисляването на тази сила
според резултатите установяваме каква е вероятността за
смърт.
      </p>

      <h3>Описание на работата на виртуалния сензор</h3>
      <p>Първата задача на виртуалния сензор е да изчисли дали ще
има катастрофа. Това се случва по следния алгоритъм:
      </p>
      <p>Изчисляваме по следната формула спирачния път:</p>
    </div>
  </>
);

export default CarCrashDocumentation;
